tap "borkdude/brew"
tap "clojure-lsp/brew"
tap "clojure/tools"
tap "d12frosted/emacs-plus"
tap "dopplerhq/cli"
tap "golangci/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazygit"
tap "koekeishiya/formulae"
tap "reveel-it/hacks", "git@github.com:reveel-it/homebrew-hacks.git"
brew "asdf"
brew "autoconf"
brew "awk"
brew "openssl@3"
brew "sqlite"
brew "aws-sam-cli"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "cmake"
brew "colima"
brew "coreutils"
brew "curl"
brew "direnv"
brew "dtc"
brew "libsodium"
brew "libtool"
brew "unixodbc"
brew "exercism"
brew "fd"
brew "gnutls"
brew "harfbuzz"
brew "ffmpeg"
brew "gcc"
brew "ghostscript"
brew "git"
brew "go"
brew "gperf"
brew "icu4c@76"
brew "graphviz"
brew "grip"
brew "helix"
brew "hyperfine"
brew "iftop"
brew "imagemagick"
brew "iredis"
brew "jq"
brew "libgccjit"
brew "libmagic"
brew "libvterm"
brew "magic-wormhole"
brew "markdown"
brew "mas"
brew "mysql-client"
brew "neofetch"
brew "pandoc"
brew "pgformatter"
brew "pigz"
brew "pipx"
brew "pkgconf"
brew "postgresql@15", restart_service: :changed, link: true
brew "protobuf"
brew "putty"
brew "python@3.11"
brew "qemu"
brew "rabbitmq", restart_service: :changed
brew "redis", restart_service: :changed
brew "ripgrep"
brew "rlwrap"
brew "rust-analyzer"
brew "shellcheck"
brew "shfmt"
brew "starship"
brew "trash", link: true
brew "tuntox"
brew "watchman"
brew "borkdude/brew/clj-kondo"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "clojure/tools/clojure"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-modern-doom3-icon", "with-native-comp"]
brew "dopplerhq/cli/doppler", link: false
brew "golangci/tap/golangci-lint"
brew "heroku/brew/heroku"
brew "jesseduffield/lazygit/lazygit"
cask "amethyst"
cask "discord"
cask "docker"
cask "element"
cask "firefox"
cask "google-chrome"
cask "gpg-suite-no-mail"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "lagrange"
cask "ollama"
cask "raycast"
cask "signal"
cask "temurin@17"
cask "visual-studio-code"
cask "vscodium"
cask "wezterm"
mas "Keynote", id: 409183694
mas "Microsoft Excel", id: 462058435
mas "Microsoft OneNote", id: 784801555
mas "Microsoft Outlook", id: 985367838
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "OneDrive", id: 823766827
mas "Pages", id: 409201541
mas "Yubico Authenticator", id: 1497506650
vscode "databricks.databricks"
vscode "dbaeumer.vscode-eslint"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "mkhl.direnv"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-pyright.pyright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vsliveshare.vsliveshare"
vscode "mvllow.rose-pine"
vscode "redhat.vscode-yaml"
vscode "vscodevim.vim"
