tap "aws/tap"
tap "borkdude/brew"
tap "clojure/tools"
tap "coursier/formulas"
tap "d12frosted/emacs-plus"
tap "golangci/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "ccache"
brew "cmake"
brew "coreutils"
brew "direnv"
brew "fd"
brew "libtool"
brew "gnutls"
brew "harfbuzz"
brew "ffmpeg"
brew "ghostscript"
brew "git"
brew "go"
brew "graphviz"
brew "grip"
brew "jq"
brew "libvterm"
brew "magic-wormhole"
brew "markdown"
brew "mupdf-tools"
brew "mysql-client"
brew "neofetch"
brew "ninja"
brew "pandoc"
brew "parquet-tools"
brew "platformio"
brew "postgresql"
brew "qpdf"
brew "rabbitmq", restart_service: true
brew "ripgrep"
brew "rlwrap"
brew "rust-analyzer"
brew "scala"
brew "shellcheck"
brew "starship"
brew "trash"
brew "watchman"
brew "xpdf"
brew "yarn"
brew "aws/tap/aws-sam-cli"
brew "borkdude/brew/clj-kondo"
brew "clojure/tools/clojure"
brew "coursier/formulas/coursier"
brew "d12frosted/emacs-plus/emacs-plus@27", args: ["with-modern-alecive-flatwoken-icon"]
brew "golangci/tap/golangci-lint"
brew "heroku/brew/heroku"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
cask "amethyst"
cask "discord"
cask "firefox"
cask "gpg-suite-no-mail"
cask "iterm2"
cask "karabiner-elements"
cask "michaelvillar-timer"
cask "ngrok"
cask "nosql-workbench"
cask "signal"
cask "temurin"
cask "visual-studio-code"
